src_Extension/Reports/Расш1_ОстаткиИДоступностьТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>Расш1_ОстаткиИДоступностьТоваров</Name>
		</Properties>
	</Report>
</MetaDataObject>

src_Extension/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_Extension/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/Reports/Расш1_ОстаткиИДоступностьТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	ЗначениеПоиска = Новый ПараметрКомпоновкиДанных("СтрокаСейчас");
	ЭлементПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ЗначениеПоиска);
	ЭлементПараметрыДанных.Значение = НСтр("ru = 'Сейчас';
											|en = 'Now'");
	
	ЗначениеПоиска = Новый ПараметрКомпоновкиДанных("СтрокаОжидается");
	ЭлементПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ЗначениеПоиска);
	ЭлементПараметрыДанных.Значение = НСтр("ru = 'Ожидается';
											|en = 'Expected'");
	
	ЗначениеПоиска = Новый ПараметрКомпоновкиДанных("СтрокаВсего");
	ЭлементПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ЗначениеПоиска);
	ЭлементПараметрыДанных.Значение = НСтр("ru = 'Всего';
											|en = 'Total'");
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	// Вызов из самообслуживания.
	Если ОбщегоНазначенияУТКлиентСервер.АвторизованВнешнийПользователь() Тогда
		ПараметрВыводитьОтбор = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор");
		Если ПараметрВыводитьОтбор <> Неопределено Тогда
			ПараметрВыводитьОтбор.Использование = Истина;
			ПараметрВыводитьОтбор.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
		КонецЕсли;
	КонецЕсли;

	// Стандартная компоновка отчета.
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПодставитьТекстыЗапросаОстатков(СхемаКомпоновкиДанных);
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаВесНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаОбъемНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));

	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПараметризуемыеЗаголовкиПолей(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Вывод описания параметров под отчётом
	ВывестиОписаниеПараметров(ДокументРезультат);
	
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	Настройки.События.ПередЗаполнениемПанелиБыстрыхНастроек	= Истина;
	
КонецПроцедуры

// Вызывается до перезаполнения панели настроек формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//   ПараметрыЗаполнения - Структура - параметры, которые будут загружены в отчет.
//
Процедура ПередЗаполнениемПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
		ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
		ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметркомпоновкиДанных("ПоказатьОбособленныеТовары"));
		ПараметрДанных.ИдентификаторПользовательскойНастройки = "";
	КонецЕсли;
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;

	// Изменение настроек по функциональным опциям
	НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроекФормы);

КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		Если Параметры.Свойство("ОписаниеКоманды")
			И Параметры.ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда
			
			// Структура с полями из ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов.
			ОписаниеКоманды = Параметры.ОписаниеКоманды; // Структура -
			ДополнительныеПараметрыКоманды = ОписаниеКоманды.ДополнительныеПараметры; // Структура -
			Если ДополнительныеПараметрыКоманды.ИмяКоманды = "ОстаткиИДоступность" Тогда
				Форма.ФормаПараметры.Отбор.Вставить("Номенклатура", Параметры.ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиОписаниеПараметров(ДокументРезультат)
	
	ТекстОписания = "
	|
	|Описание параметров отчета
	|==========================
	|
	|Отчет показывает остатки и доступность товаров на складах.
	|Это расширение типового отчета ОстаткиИДоступностьТоваров.
	|
	|ИСТОЧНИК ДАННЫХ
	|---------------
	|В зависимости от режима работы системы:
	|  * Производительный режим - РегистрНакопления.ЗапасыИПотребности (остатки)
	|  * Обычный режим - РегистрСведений.РаспределениеЗапасов
	|
	|ОСОБЕННОСТИ РАСЧЕТА
	|-------------------
	|  * Заказы переработчику (ЗаказПереработчику, ЗаказПереработчику2_5) - исключаются из отчета
	|  * Этапы производства - данные берутся из РегистрСведений.РаспределениеЗапасов,
	|    где уже учтён остаток к выпуску (КоличествоПлан - КоличествоФакт - КоличествоОтменено).
	|    Если часть продукции выпущена, она автоматически не учитывается в ожидаемом поступлении
	|
	|ПАРАМЕТРЫ
	|---------
	|ПОКАЗАТЬ ОБОСОБЛЕННЫЕ ТОВАРЫ - управляет отображением товаров с назначением:
	|  * Включено - показывает все товары, включая обособленные под заказы
	|  * Выключено - только свободные товары (без назначения)
	|
	|СЕГМЕНТ НОМЕНКЛАТУРЫ - фильтр по сегменту номенклатуры (если используется)
	|
	|НОМЕНКЛАТУРА, ХАРАКТЕРИСТИКА, СКЛАД - стандартные отборы
	|
	|КОЛОНКИ ОТЧЕТА
	|--------------
	|  * Номенклатура, Характеристика - товар
	|  * ИПП - дополнительное сведение номенклатуры (индивидуальный производственный показатель)
	|  * Склад - место хранения
	|  * Назначение - обособление под заказ (если есть)
	|  * Заказ - заказ на поступление
	|  * ДатаСобытия - дата ожидаемого поступления
	|  * ВНаличииОстаток (Сейчас) - текущий остаток на складе
	|  * ПоступитОстаток (Ожидается) - ожидаемое поступление (для этапов производства - только непроизведенное)
	|  * Всего - сумма наличия и ожидаемого
	|";
	
	// Вывод текста описания построчно
	СтрокиОписания = СтрРазделить(ТекстОписания, Символы.ПС, Ложь);
	Для Каждого СтрокаОписания Из СтрокиОписания Цикл
		МакетСтроки = Новый ТабличныйДокумент;
		ОбластьСтроки = МакетСтроки.ПолучитьОбласть(1, 1, 1, 1);
		ОбластьСтроки.Область(1, 1).Текст = СтрокаОписания;
		ОбластьСтроки.Область(1, 1).ЦветТекста = WebЦвета.Серый;
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
КонецПроцедуры

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	
	ВспомогательныеПараметры.Добавить("КоличественныеИтогиПоЕдИзм");
	
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	
	Возврат ВспомогательныеПараметры;

КонецФункции

Функция ПараметризуемыеЗаголовкиПолей()
	
	Возврат КомпоновкаДанныхСервер.СоответствиеЗаголовковПолейЕдиницИзмерений(КомпоновщикНастроек);
	
КонецФункции

Процедура НастроитьПараметрыОтборыПоФункциональнымОпциям(КомпоновщикНастроекФормы)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмеренияДляОтчетов") Тогда
		КомпоновкаДанныхСервер.УдалитьПараметрИзПользовательскихНастроекОтчета(КомпоновщикНастроекФормы, "ЕдиницыКоличества");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодставитьТекстыЗапросаОстатков(Макет)
	
	// Расш1: Запрос для ЗапасыИПотребности теперь изменён непосредственно в СКД (Template.xml):
	// - Добавлено состояние ПоступлениеНеПодтвержденное для учёта этапов производства с неподтверждённым графиком
	// - Добавлена фильтрация заказов переработчику
	// - Убрано условие ГДЕ ЛОЖЬ, запрос теперь выполняется напрямую
	
	// Расш1: Добавление колонки ИПП (дополнительное сведение номенклатуры)
	ДобавитьПолеИПП(Макет);
	
КонецПроцедуры

// Добавляет поле ИПП (дополнительное сведение номенклатуры) в отчет
Процедура ДобавитьПолеИПП(СхемаКомпоновкиДанных)
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	// Добавляем временную таблицу с ИПП номенклатур перед финальным запросом
	ТекстТаблицыИПП = 
	"////////////////////////////////////////////////////////////////////////////////
	|// Расш1: Временная таблица ИПП номенклатур.
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(250)) КАК ИПП
	|ПОМЕСТИТЬ ТаблицаИППНоменклатур
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойствоИПП
	|		ПО ДополнительныеСведения.Свойство = СвойствоИПП.Ссылка
	|ГДЕ
	|	СвойствоИПП.Наименование = ""ИПП""
	|	И ТИПЗНАЧЕНИЯ(ДополнительныеСведения.Объект) = ТИП(Справочник.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|";
	
	// Вставляем таблицу ИПП перед финальным запросом "// Построение отчета."
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"////////////////////////////////////////////////////////////////////////////////
|// Построение отчета.",
		ТекстТаблицыИПП + "////////////////////////////////////////////////////////////////////////////////
|// Построение отчета.");
	
	// Добавляем поле ИПП в первый SELECT финального запроса
	// Ищем паттерн с Вес и Объем и добавляем ИПП перед ними
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем
		|ИЗ
		|	ТаблицаДанныхОтчетаБезДополнительныхПолей КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхОтчетаСгруппированная КАК ТаблицаСгруппированная",
		"&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем,
		|	ЕСТЬNULL(ТаблицаИПП.ИПП, """") КАК ИПП
		|ИЗ
		|	ТаблицаДанныхОтчетаБезДополнительныхПолей КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИППНоменклатур КАК ТаблицаИПП
		|		ПО ТаблицаИПП.Номенклатура = Таблица.Номенклатура
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхОтчетаСгруппированная КАК ТаблицаСгруппированная");
	
	// Добавляем поле ИПП во второй SELECT финального запроса (ОБЪЕДИНИТЬ ВСЕ)
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем
		|ИЗ
		|	ТаблицаДанныхОтчетаСгруппированная КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхОтчетаБезДополнительныхПолей КАК ТаблицаДанных",
		"&ТекстЗапросаВесНоменклатуры КАК Вес,
		|	&ТекстЗапросаОбъемНоменклатуры КАК Объем,
		|	ЕСТЬNULL(ТаблицаИПП2.ИПП, """") КАК ИПП
		|ИЗ
		|	ТаблицаДанныхОтчетаСгруппированная КАК Таблица
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИППНоменклатур КАК ТаблицаИПП2
		|		ПО ТаблицаИПП2.Номенклатура = Таблица.Номенклатура
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхОтчетаБезДополнительныхПолей КАК ТаблицаДанных");
	
	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	// Добавляем описание поля ИПП в набор данных
	ДобавитьПолеИППВСхему(СхемаКомпоновкиДанных);
	
КонецПроцедуры

// Добавляет описание поля ИПП в схему компоновки данных
Процедура ДобавитьПолеИППВСхему(СхемаКомпоновкиДанных)
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Основной;
	
	// Проверяем, нет ли уже такого поля
	Для Каждого Поле Из НаборДанных.Поля Цикл
		Если Поле.Поле = "ИПП" Тогда
			Возврат; // Поле уже существует
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем новое поле
	НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПоле.Поле = "ИПП";
	НовоеПоле.ПутьКДанным = "ИПП";
	НовоеПоле.Заголовок = НСтр("ru = 'ИПП';
								|en = 'IPP'");
	НовоеПоле.ТипЗначения = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
